{
  "kind": "build_request",
  "title": "Add 'Print on demand available' information line to the Zayora landing page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add one additional information line on the landing page that clearly states that print-on-demand service is available, using correct English wording (e.g., \"Print on demand available\"). Place it in a prominent, visually consistent location (such as within the hero text block or near the ordering call-to-action) without removing or changing the existing required business title, founder line, or phone numbers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Add 1 more information print on dimand available"
        ]
      },
      "acceptanceCriteria": [
        "The page displays an additional line of text that communicates \"Print on demand available\" (or equivalent correct English phrasing).",
        "The new information is visible on initial page load without requiring navigation to another page.",
        "Existing required texts remain present and unchanged: \"Men's Clothing Store\", \"Founder: Yash Jaiswal\", main contact number \"9919031636\", and ordering number \"9919031626\".",
        "The new line matches the existing site styling (typography/colors/spacing) and does not introduce a new theme."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the app as a single-page static landing page; do not add backend dependencies for this text change.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Do not change phone numbers, tel: links, brand name usage, or existing sections (Gallery, Products Coming Soon, Contact) beyond adding the requested single information line.",
    "No new authentication, forms, or backend endpoints."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}